from blogapp.utils import LanguageUtils

TEXT = """
        মনে মোৰ উৰিব বিচাৰে;
        নীলাকাশৰ বুকু সজাই।
        বতাহৰ নৈ লৈ উটুৱাই লৈ যাবলৈ;
        মনোৰচনাৰ সাধুকথা চপাই।

        মনে মোৰ পাখি খোজে মেলিবলৈ;
        জিৰণি লবলৈ মুকলি পৃথিৱীৰ মুকুতাত।
        বিচাৰে পদে নুচোৱক কেতিয়াও;
        একেই স্পৰ্শৰ, চিনাকি মজিয়া।

        খোজে মোৰ মনে, যাযাবৰী হ‌ওক;
        এই জীৱনৰ উচ্চতম বৌদ্ধিক ক্ৰীড়া;
        যিহেৰে হৈ পাওঁ আমি সেই সত্যাত্মাৰ;
        চাগে কেতিয়াবা একেলগ সমনীয়া।
        """


def main():
    language_utils = LanguageUtils(TEXT)
    print(language_utils.detect_language())


if __name__ == "__main__":
    main()
